---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AdvancedLossFactor Properties
AdvancedLossFactor Class See Also Send Feedback
---

The AdvancedLossFactor type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | BallastLossFactor | The ballast loss factor. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from LossFactor.) |
|  | LampLumenDepreciation | The lamp lumen depreciation loss factor. |
|  | LampTiltLossFactor | The lamp tilt loss factor. |
|  | LossFactorValue | The calculated loss factor value  (Inherited from LossFactor.) |
|  | LuminaireDirtDepreciation | The luminaire dirt depreciation loss factor. |
|  | SurfaceDepreciationLossFactor | The surface depreciation loss factor. |
|  | TemperatureLossFactor | The temperature loss factor. |
|  | VoltageLossFactor | The voltage loss factor. |

# See Also

AdvancedLossFactor Class

Autodesk.Revit.DB.Lighting Namespace